{
  "format": "graph-model",
  "generatedBy": "1.15.0",
  "convertedBy": "TensorFlow.js Converter v1.4.0",
  "userDefinedMetadata": {
	"signature": {
	  "outputs": {
		"ae_encoder/fc_bottleneck/LeakyRelu": {
		  "name": "ae_encoder/fc_bottleneck/LeakyRelu"
		},
		"ae_decoder/truediv": {
		  "name": "ae_decoder/truediv"
		}
	  }
	}
  },
  "modelTopology": {
	"node": [
	  {
		"name": "Placeholder",
		"op": "Placeholder",
		"attr": {
		  "shape": {
			"shape": {
			  "dim": [
				{
				  "size": "-1"
				},
				{
				  "size": "64"
				},
				{
				  "size": "64"
				}
			  ]
			}
		  },
		  "dtype": {
			"type": "DT_FLOAT"
		  }
		}
	  },
	  {
		"name": "Reshape/shape",
		"op": "Const",
		"attr": {
		  "value": {
			"tensor": {
			  "dtype": "DT_INT32",
			  "tensorShape": {
				"dim": [
				  {
					"size": "4"
				  }
				]
			  }
			}
		  },
		  "dtype": {
			"type": "DT_INT32"
		  }
		}
	  },
	  {
		"name": "ae_encoder/res1/conv2d/kernel",
		"op": "Const",
		"attr": {
		  "value": {
			"tensor": {
			  "dtype": "DT_FLOAT",
			  "tensorShape": {
				"dim": [
				  {
					"size": "1"
				  },
				  {
					"size": "1"
				  },
				  {
					"size": "1"
				  },
				  {
					"size": "32"
				  }
				]
			  }
			}
		  },
		  "dtype": {
			"type": "DT_FLOAT"
		  }
		}
	  },
	  {
		"name": "ae_decoder/res6/separable_conv2d_12/depthwise_kernel",
		"op": "Const",
		"attr": {
		  "value": {
			"tensor": {
			  "dtype": "DT_FLOAT",
			  "tensorShape": {
				"dim": [
				  {
					"size": "3"
				  },
				  {
					"size": "3"
				  },
				  {
					"size": "128"
				  },
				  {
					"size": "1"
				  }
				]
			  }
			}
		  },
		  "dtype": {
			"type": "DT_FLOAT"
		  }
		}
	  },
	  {
		"name": "ae_encoder/res1/separable_conv2d/depthwise_kernel",
		"op": "Const",
		"attr": {
		  "value": {
			"tensor": {
			  "dtype": "DT_FLOAT",
			  "tensorShape": {
				"dim": [
				  {
					"size": "3"
				  },
				  {
					"size": "3"
				  },
				  {
					"size": "1"
				  },
				  {
					"size": "1"
				  }
				]
			  }
			}
		  },
		  "dtype": {
			"type": "DT_FLOAT"
		  }
		}
	  },
	  {
		"name": "ae_decoder/res9/BatchNorm_1/beta",
		"op": "Const",
		"attr": {
		  "value": {
			"tensor": {
			  "dtype": "DT_FLOAT",
			  "tensorShape": {
				"dim": [
				  {
					"size": "32"
				  }
				]
			  }
			}
		  },
		  "dtype": {
			"type": "DT_FLOAT"
		  }
		}
	  },
	  {
		"name": "ae_encoder/res1/separable_conv2d/pointwise_kernel",
		"op": "Const",
		"attr": {
		  "value": {
			"tensor": {
			  "dtype": "DT_FLOAT",
			  "tensorShape": {
				"dim": [
				  {
					"size": "1"
				  },
				  {
					"size": "1"
				  },
				  {
					"size": "1"
				  },
				  {
					"size": "32"
				  }
				]
			  }
			}
		  },
		  "dtype": {
			"type": "DT_FLOAT"
		  }
		}
	  },
	  {
		"name": "ae_encoder/res1/BatchNorm/Const",
		"op": "Const",
		"attr": {
		  "value": {
			"tensor": {
			  "dtype": "DT_FLOAT",
			  "tensorShape": {
				"dim": [
				  {
					"size": "32"
				  }
				]
			  }
			}
		  },
		  "dtype": {
			"type": "DT_FLOAT"
		  }
		}
	  },
	  {
		"name": "ae_encoder/res1/BatchNorm/beta",
		"op": "Const",
		"attr": {
		  "value": {
			"tensor": {
			  "dtype": "DT_FLOAT",
			  "tensorShape": {
				"dim": [
				  {
					"size": "32"
				  }
				]
			  }
			}
		  },
		  "dtype": {
			"type": "DT_FLOAT"
		  }
		}
	  },
	  {
		"name": "ae_decoder/res6/separable_conv2d_12/pointwise_kernel",
		"op": "Const",
		"attr": {
		  "value": {
			"tensor": {
			  "dtype": "DT_FLOAT",
			  "tensorShape": {
				"dim": [
				  {
					"size": "1"
				  },
				  {
					"size": "1"
				  },
				  {
					"size": "128"
				  },
				  {
					"size": "64"
				  }
				]
			  }
			}
		  },
		  "dtype": {
			"type": "DT_FLOAT"
		  }
		}
	  },
	  {
		"name": "ae_encoder/res1/BatchNorm/Const_1",
		"op": "Const",
		"attr": {
		  "value": {
			"tensor": {
			  "dtype": "DT_FLOAT",
			  "tensorShape": {
				"dim": [
				  {}
				]
			  }
			}
		  },
		  "dtype": {
			"type": "DT_FLOAT"
		  }
		}
	  },
	  {
		"name": "ae_encoder/res1/conv2d_1/kernel",
		"op": "Const",
		"attr": {
		  "value": {
			"tensor": {
			  "dtype": "DT_FLOAT",
			  "tensorShape": {
				"dim": [
				  {
					"size": "1"
				  },
				  {
					"size": "1"
				  },
				  {
					"size": "32"
				  },
				  {
					"size": "32"
				  }
				]
			  }
			}
		  },
		  "dtype": {
			"type": "DT_FLOAT"
		  }
		}
	  },
	  {
		"name": "ae_encoder/res1/BatchNorm_1/beta",
		"op": "Const",
		"attr": {
		  "value": {
			"tensor": {
			  "dtype": "DT_FLOAT",
			  "tensorShape": {
				"dim": [
				  {
					"size": "32"
				  }
				]
			  }
			}
		  },
		  "dtype": {
			"type": "DT_FLOAT"
		  }
		}
	  },
	  {
		"name": "ae_encoder/res1/BatchNorm_2/beta",
		"op": "Const",
		"attr": {
		  "value": {
			"tensor": {
			  "dtype": "DT_FLOAT",
			  "tensorShape": {
				"dim": [
				  {
					"size": "32"
				  }
				]
			  }
			}
		  },
		  "dtype": {
			"type": "DT_FLOAT"
		  }
		}
	  },
	  {
		"name": "ae_decoder/res6/BatchNorm/Const",
		"op": "Const",
		"attr": {
		  "value": {
			"tensor": {
			  "dtype": "DT_FLOAT",
			  "tensorShape": {
				"dim": [
				  {
					"size": "64"
				  }
				]
			  }
			}
		  },
		  "dtype": {
			"type": "DT_FLOAT"
		  }
		}
	  },
	  {
		"name": "ae_encoder/res2/conv2d_2/kernel",
		"op": "Const",
		"attr": {
		  "value": {
			"tensor": {
			  "dtype": "DT_FLOAT",
			  "tensorShape": {
				"dim": [
				  {
					"size": "1"
				  },
				  {
					"size": "1"
				  },
				  {
					"size": "32"
				  },
				  {
					"size": "32"
				  }
				]
			  }
			}
		  },
		  "dtype": {
			"type": "DT_FLOAT"
		  }
		}
	  },
	  {
		"name": "ae_decoder/res6/BatchNorm/beta",
		"op": "Const",
		"attr": {
		  "value": {
			"tensor": {
			  "dtype": "DT_FLOAT",
			  "tensorShape": {
				"dim": [
				  {
					"size": "64"
				  }
				]
			  }
			}
		  },
		  "dtype": {
			"type": "DT_FLOAT"
		  }
		}
	  },
	  {
		"name": "ae_encoder/res2/separable_conv2d_1/depthwise_kernel",
		"op": "Const",
		"attr": {
		  "value": {
			"tensor": {
			  "dtype": "DT_FLOAT",
			  "tensorShape": {
				"dim": [
				  {
					"size": "3"
				  },
				  {
					"size": "3"
				  },
				  {
					"size": "32"
				  },
				  {
					"size": "1"
				  }
				]
			  }
			}
		  },
		  "dtype": {
			"type": "DT_FLOAT"
		  }
		}
	  },
	  {
		"name": "ae_encoder/res2/separable_conv2d_1/pointwise_kernel",
		"op": "Const",
		"attr": {
		  "value": {
			"tensor": {
			  "dtype": "DT_FLOAT",
			  "tensorShape": {
				"dim": [
				  {
					"size": "1"
				  },
				  {
					"size": "1"
				  },
				  {
					"size": "32"
				  },
				  {
					"size": "32"
				  }
				]
			  }
			}
		  },
		  "dtype": {
			"type": "DT_FLOAT"
		  }
		}
	  },
	  {
		"name": "ae_encoder/res2/BatchNorm/beta",
		"op": "Const",
		"attr": {
		  "value": {
			"tensor": {
			  "dtype": "DT_FLOAT",
			  "tensorShape": {
				"dim": [
				  {
					"size": "32"
				  }
				]
			  }
			}
		  },
		  "dtype": {
			"type": "DT_FLOAT"
		  }
		}
	  },
	  {
		"name": "ae_encoder/res2/conv2d_3/kernel",
		"op": "Const",
		"attr": {
		  "value": {
			"tensor": {
			  "dtype": "DT_FLOAT",
			  "tensorShape": {
				"dim": [
				  {
					"size": "1"
				  },
				  {
					"size": "1"
				  },
				  {
					"size": "32"
				  },
				  {
					"size": "32"
				  }
				]
			  }
			}
		  },
		  "dtype": {
			"type": "DT_FLOAT"
		  }
		}
	  },
	  {
		"name": "ae_encoder/res2/BatchNorm_1/beta",
		"op": "Const",
		"attr": {
		  "value": {
			"tensor": {
			  "dtype": "DT_FLOAT",
			  "tensorShape": {
				"dim": [
				  {
					"size": "32"
				  }
				]
			  }
			}
		  },
		  "dtype": {
			"type": "DT_FLOAT"
		  }
		}
	  },
	  {
		"name": "ae_encoder/res2/BatchNorm_2/beta",
		"op": "Const",
		"attr": {
		  "value": {
			"tensor": {
			  "dtype": "DT_FLOAT",
			  "tensorShape": {
				"dim": [
				  {
					"size": "32"
				  }
				]
			  }
			}
		  },
		  "dtype": {
			"type": "DT_FLOAT"
		  }
		}
	  },
	  {
		"name": "ae_decoder/res6/conv2d_25/kernel",
		"op": "Const",
		"attr": {
		  "value": {
			"tensor": {
			  "dtype": "DT_FLOAT",
			  "tensorShape": {
				"dim": [
				  {
					"size": "1"
				  },
				  {
					"size": "1"
				  },
				  {
					"size": "64"
				  },
				  {
					"size": "64"
				  }
				]
			  }
			}
		  },
		  "dtype": {
			"type": "DT_FLOAT"
		  }
		}
	  },
	  {
		"name": "ae_encoder/res3/conv2d_4/kernel",
		"op": "Const",
		"attr": {
		  "value": {
			"tensor": {
			  "dtype": "DT_FLOAT",
			  "tensorShape": {
				"dim": [
				  {
					"size": "1"
				  },
				  {
					"size": "1"
				  },
				  {
					"size": "32"
				  },
				  {
					"size": "64"
				  }
				]
			  }
			}
		  },
		  "dtype": {
			"type": "DT_FLOAT"
		  }
		}
	  },
	  {
		"name": "ae_encoder/res3/separable_conv2d_2/depthwise_kernel",
		"op": "Const",
		"attr": {
		  "value": {
			"tensor": {
			  "dtype": "DT_FLOAT",
			  "tensorShape": {
				"dim": [
				  {
					"size": "3"
				  },
				  {
					"size": "3"
				  },
				  {
					"size": "32"
				  },
				  {
					"size": "1"
				  }
				]
			  }
			}
		  },
		  "dtype": {
			"type": "DT_FLOAT"
		  }
		}
	  },
	  {
		"name": "ae_encoder/res3/separable_conv2d_2/pointwise_kernel",
		"op": "Const",
		"attr": {
		  "value": {
			"tensor": {
			  "dtype": "DT_FLOAT",
			  "tensorShape": {
				"dim": [
				  {
					"size": "1"
				  },
				  {
					"size": "1"
				  },
				  {
					"size": "32"
				  },
				  {
					"size": "64"
				  }
				]
			  }
			}
		  },
		  "dtype": {
			"type": "DT_FLOAT"
		  }
		}
	  },
	  {
		"name": "ae_encoder/res3/BatchNorm/beta",
		"op": "Const",
		"attr": {
		  "value": {
			"tensor": {
			  "dtype": "DT_FLOAT",
			  "tensorShape": {
				"dim": [
				  {
					"size": "64"
				  }
				]
			  }
			}
		  },
		  "dtype": {
			"type": "DT_FLOAT"
		  }
		}
	  },
	  {
		"name": "ae_decoder/res6/BatchNorm_1/beta",
		"op": "Const",
		"attr": {
		  "value": {
			"tensor": {
			  "dtype": "DT_FLOAT",
			  "tensorShape": {
				"dim": [
				  {
					"size": "64"
				  }
				]
			  }
			}
		  },
		  "dtype": {
			"type": "DT_FLOAT"
		  }
		}
	  },
	  {
		"name": "ae_encoder/res3/conv2d_5/kernel",
		"op": "Const",
		"attr": {
		  "value": {
			"tensor": {
			  "dtype": "DT_FLOAT",
			  "tensorShape": {
				"dim": [
				  {
					"size": "1"
				  },
				  {
					"size": "1"
				  },
				  {
					"size": "64"
				  },
				  {
					"size": "64"
				  }
				]
			  }
			}
		  },
		  "dtype": {
			"type": "DT_FLOAT"
		  }
		}
	  },
	  {
		"name": "ae_encoder/res3/BatchNorm_1/beta",
		"op": "Const",
		"attr": {
		  "value": {
			"tensor": {
			  "dtype": "DT_FLOAT",
			  "tensorShape": {
				"dim": [
				  {
					"size": "64"
				  }
				]
			  }
			}
		  },
		  "dtype": {
			"type": "DT_FLOAT"
		  }
		}
	  },
	  {
		"name": "ae_encoder/res3/BatchNorm_2/beta",
		"op": "Const",
		"attr": {
		  "value": {
			"tensor": {
			  "dtype": "DT_FLOAT",
			  "tensorShape": {
				"dim": [
				  {
					"size": "64"
				  }
				]
			  }
			}
		  },
		  "dtype": {
			"type": "DT_FLOAT"
		  }
		}
	  },
	  {
		"name": "ae_encoder/res4/conv2d_6/kernel",
		"op": "Const",
		"attr": {
		  "value": {
			"tensor": {
			  "dtype": "DT_FLOAT",
			  "tensorShape": {
				"dim": [
				  {
					"size": "1"
				  },
				  {
					"size": "1"
				  },
				  {
					"size": "64"
				  },
				  {
					"size": "64"
				  }
				]
			  }
			}
		  },
		  "dtype": {
			"type": "DT_FLOAT"
		  }
		}
	  },
	  {
		"name": "ae_encoder/res4/separable_conv2d_3/depthwise_kernel",
		"op": "Const",
		"attr": {
		  "value": {
			"tensor": {
			  "dtype": "DT_FLOAT",
			  "tensorShape": {
				"dim": [
				  {
					"size": "3"
				  },
				  {
					"size": "3"
				  },
				  {
					"size": "64"
				  },
				  {
					"size": "1"
				  }
				]
			  }
			}
		  },
		  "dtype": {
			"type": "DT_FLOAT"
		  }
		}
	  },
	  {
		"name": "ae_encoder/res4/separable_conv2d_3/pointwise_kernel",
		"op": "Const",
		"attr": {
		  "value": {
			"tensor": {
			  "dtype": "DT_FLOAT",
			  "tensorShape": {
				"dim": [
				  {
					"size": "1"
				  },
				  {
					"size": "1"
				  },
				  {
					"size": "64"
				  },
				  {
					"size": "64"
				  }
				]
			  }
			}
		  },
		  "dtype": {
			"type": "DT_FLOAT"
		  }
		}
	  },
	  {
		"name": "ae_encoder/res4/BatchNorm/beta",
		"op": "Const",
		"attr": {
		  "value": {
			"tensor": {
			  "dtype": "DT_FLOAT",
			  "tensorShape": {
				"dim": [
				  {
					"size": "64"
				  }
				]
			  }
			}
		  },
		  "dtype": {
			"type": "DT_FLOAT"
		  }
		}
	  },
	  {
		"name": "ae_decoder/res6/BatchNorm_2/beta",
		"op": "Const",
		"attr": {
		  "value": {
			"tensor": {
			  "dtype": "DT_FLOAT",
			  "tensorShape": {
				"dim": [
				  {
					"size": "64"
				  }
				]
			  }
			}
		  },
		  "dtype": {
			"type": "DT_FLOAT"
		  }
		}
	  },
	  {
		"name": "ae_encoder/res4/conv2d_7/kernel",
		"op": "Const",
		"attr": {
		  "value": {
			"tensor": {
			  "dtype": "DT_FLOAT",
			  "tensorShape": {
				"dim": [
				  {
					"size": "1"
				  },
				  {
					"size": "1"
				  },
				  {
					"size": "64"
				  },
				  {
					"size": "64"
				  }
				]
			  }
			}
		  },
		  "dtype": {
			"type": "DT_FLOAT"
		  }
		}
	  },
	  {
		"name": "ae_encoder/res4/BatchNorm_1/beta",
		"op": "Const",
		"attr": {
		  "value": {
			"tensor": {
			  "dtype": "DT_FLOAT",
			  "tensorShape": {
				"dim": [
				  {
					"size": "64"
				  }
				]
			  }
			}
		  },
		  "dtype": {
			"type": "DT_FLOAT"
		  }
		}
	  },
	  {
		"name": "ae_encoder/res4/BatchNorm_2/beta",
		"op": "Const",
		"attr": {
		  "value": {
			"tensor": {
			  "dtype": "DT_FLOAT",
			  "tensorShape": {
				"dim": [
				  {
					"size": "64"
				  }
				]
			  }
			}
		  },
		  "dtype": {
			"type": "DT_FLOAT"
		  }
		}
	  },
	  {
		"name": "ae_encoder/res6/conv2d_8/kernel",
		"op": "Const",
		"attr": {
		  "value": {
			"tensor": {
			  "dtype": "DT_FLOAT",
			  "tensorShape": {
				"dim": [
				  {
					"size": "1"
				  },
				  {
					"size": "1"
				  },
				  {
					"size": "64"
				  },
				  {
					"size": "128"
				  }
				]
			  }
			}
		  },
		  "dtype": {
			"type": "DT_FLOAT"
		  }
		}
	  },
	  {
		"name": "ae_encoder/res6/separable_conv2d_4/depthwise_kernel",
		"op": "Const",
		"attr": {
		  "value": {
			"tensor": {
			  "dtype": "DT_FLOAT",
			  "tensorShape": {
				"dim": [
				  {
					"size": "3"
				  },
				  {
					"size": "3"
				  },
				  {
					"size": "64"
				  },
				  {
					"size": "1"
				  }
				]
			  }
			}
		  },
		  "dtype": {
			"type": "DT_FLOAT"
		  }
		}
	  },
	  {
		"name": "ae_encoder/res6/separable_conv2d_4/pointwise_kernel",
		"op": "Const",
		"attr": {
		  "value": {
			"tensor": {
			  "dtype": "DT_FLOAT",
			  "tensorShape": {
				"dim": [
				  {
					"size": "1"
				  },
				  {
					"size": "1"
				  },
				  {
					"size": "64"
				  },
				  {
					"size": "128"
				  }
				]
			  }
			}
		  },
		  "dtype": {
			"type": "DT_FLOAT"
		  }
		}
	  },
	  {
		"name": "ae_decoder/res8/conv2d_26/kernel",
		"op": "Const",
		"attr": {
		  "value": {
			"tensor": {
			  "dtype": "DT_FLOAT",
			  "tensorShape": {
				"dim": [
				  {
					"size": "1"
				  },
				  {
					"size": "1"
				  },
				  {
					"size": "64"
				  },
				  {
					"size": "64"
				  }
				]
			  }
			}
		  },
		  "dtype": {
			"type": "DT_FLOAT"
		  }
		}
	  },
	  {
		"name": "ae_encoder/res6/BatchNorm/Const",
		"op": "Const",
		"attr": {
		  "value": {
			"tensor": {
			  "dtype": "DT_FLOAT",
			  "tensorShape": {
				"dim": [
				  {
					"size": "128"
				  }
				]
			  }
			}
		  },
		  "dtype": {
			"type": "DT_FLOAT"
		  }
		}
	  },
	  {
		"name": "ae_encoder/res6/BatchNorm/beta",
		"op": "Const",
		"attr": {
		  "value": {
			"tensor": {
			  "dtype": "DT_FLOAT",
			  "tensorShape": {
				"dim": [
				  {
					"size": "128"
				  }
				]
			  }
			}
		  },
		  "dtype": {
			"type": "DT_FLOAT"
		  }
		}
	  },
	  {
		"name": "ae_encoder/res6/conv2d_9/kernel",
		"op": "Const",
		"attr": {
		  "value": {
			"tensor": {
			  "dtype": "DT_FLOAT",
			  "tensorShape": {
				"dim": [
				  {
					"size": "1"
				  },
				  {
					"size": "1"
				  },
				  {
					"size": "128"
				  },
				  {
					"size": "128"
				  }
				]
			  }
			}
		  },
		  "dtype": {
			"type": "DT_FLOAT"
		  }
		}
	  },
	  {
		"name": "ae_encoder/res6/BatchNorm_1/beta",
		"op": "Const",
		"attr": {
		  "value": {
			"tensor": {
			  "dtype": "DT_FLOAT",
			  "tensorShape": {
				"dim": [
				  {
					"size": "128"
				  }
				]
			  }
			}
		  },
		  "dtype": {
			"type": "DT_FLOAT"
		  }
		}
	  },
	  {
		"name": "ae_decoder/res8/separable_conv2d_13/depthwise_kernel",
		"op": "Const",
		"attr": {
		  "value": {
			"tensor": {
			  "dtype": "DT_FLOAT",
			  "tensorShape": {
				"dim": [
				  {
					"size": "3"
				  },
				  {
					"size": "3"
				  },
				  {
					"size": "64"
				  },
				  {
					"size": "1"
				  }
				]
			  }
			}
		  },
		  "dtype": {
			"type": "DT_FLOAT"
		  }
		}
	  },
	  {
		"name": "ae_encoder/res6/BatchNorm_2/beta",
		"op": "Const",
		"attr": {
		  "value": {
			"tensor": {
			  "dtype": "DT_FLOAT",
			  "tensorShape": {
				"dim": [
				  {
					"size": "128"
				  }
				]
			  }
			}
		  },
		  "dtype": {
			"type": "DT_FLOAT"
		  }
		}
	  },
	  {
		"name": "ae_decoder/res9/BatchNorm_2/beta",
		"op": "Const",
		"attr": {
		  "value": {
			"tensor": {
			  "dtype": "DT_FLOAT",
			  "tensorShape": {
				"dim": [
				  {
					"size": "32"
				  }
				]
			  }
			}
		  },
		  "dtype": {
			"type": "DT_FLOAT"
		  }
		}
	  },
	  {
		"name": "ae_encoder/res7/conv2d_10/kernel",
		"op": "Const",
		"attr": {
		  "value": {
			"tensor": {
			  "dtype": "DT_FLOAT",
			  "tensorShape": {
				"dim": [
				  {
					"size": "1"
				  },
				  {
					"size": "1"
				  },
				  {
					"size": "128"
				  },
				  {
					"size": "128"
				  }
				]
			  }
			}
		  },
		  "dtype": {
			"type": "DT_FLOAT"
		  }
		}
	  },
	  {
		"name": "ae_encoder/res7/separable_conv2d_5/depthwise_kernel",
		"op": "Const",
		"attr": {
		  "value": {
			"tensor": {
			  "dtype": "DT_FLOAT",
			  "tensorShape": {
				"dim": [
				  {
					"size": "3"
				  },
				  {
					"size": "3"
				  },
				  {
					"size": "128"
				  },
				  {
					"size": "1"
				  }
				]
			  }
			}
		  },
		  "dtype": {
			"type": "DT_FLOAT"
		  }
		}
	  },
	  {
		"name": "ae_decoder/res8/separable_conv2d_13/pointwise_kernel",
		"op": "Const",
		"attr": {
		  "value": {
			"tensor": {
			  "dtype": "DT_FLOAT",
			  "tensorShape": {
				"dim": [
				  {
					"size": "1"
				  },
				  {
					"size": "1"
				  },
				  {
					"size": "64"
				  },
				  {
					"size": "64"
				  }
				]
			  }
			}
		  },
		  "dtype": {
			"type": "DT_FLOAT"
		  }
		}
	  },
	  {
		"name": "ae_encoder/res7/separable_conv2d_5/pointwise_kernel",
		"op": "Const",
		"attr": {
		  "value": {
			"tensor": {
			  "dtype": "DT_FLOAT",
			  "tensorShape": {
				"dim": [
				  {
					"size": "1"
				  },
				  {
					"size": "1"
				  },
				  {
					"size": "128"
				  },
				  {
					"size": "128"
				  }
				]
			  }
			}
		  },
		  "dtype": {
			"type": "DT_FLOAT"
		  }
		}
	  },
	  {
		"name": "ae_encoder/res7/BatchNorm/beta",
		"op": "Const",
		"attr": {
		  "value": {
			"tensor": {
			  "dtype": "DT_FLOAT",
			  "tensorShape": {
				"dim": [
				  {
					"size": "128"
				  }
				]
			  }
			}
		  },
		  "dtype": {
			"type": "DT_FLOAT"
		  }
		}
	  },
	  {
		"name": "ae_encoder/res7/conv2d_11/kernel",
		"op": "Const",
		"attr": {
		  "value": {
			"tensor": {
			  "dtype": "DT_FLOAT",
			  "tensorShape": {
				"dim": [
				  {
					"size": "1"
				  },
				  {
					"size": "1"
				  },
				  {
					"size": "128"
				  },
				  {
					"size": "128"
				  }
				]
			  }
			}
		  },
		  "dtype": {
			"type": "DT_FLOAT"
		  }
		}
	  },
	  {
		"name": "ae_encoder/res7/BatchNorm_1/beta",
		"op": "Const",
		"attr": {
		  "value": {
			"tensor": {
			  "dtype": "DT_FLOAT",
			  "tensorShape": {
				"dim": [
				  {
					"size": "128"
				  }
				]
			  }
			}
		  },
		  "dtype": {
			"type": "DT_FLOAT"
		  }
		}
	  },
	  {
		"name": "ae_decoder/res8/BatchNorm/beta",
		"op": "Const",
		"attr": {
		  "value": {
			"tensor": {
			  "dtype": "DT_FLOAT",
			  "tensorShape": {
				"dim": [
				  {
					"size": "64"
				  }
				]
			  }
			}
		  },
		  "dtype": {
			"type": "DT_FLOAT"
		  }
		}
	  },
	  {
		"name": "ae_encoder/res7/BatchNorm_2/beta",
		"op": "Const",
		"attr": {
		  "value": {
			"tensor": {
			  "dtype": "DT_FLOAT",
			  "tensorShape": {
				"dim": [
				  {
					"size": "128"
				  }
				]
			  }
			}
		  },
		  "dtype": {
			"type": "DT_FLOAT"
		  }
		}
	  },
	  {
		"name": "ae_encoder/res8/conv2d_12/kernel",
		"op": "Const",
		"attr": {
		  "value": {
			"tensor": {
			  "dtype": "DT_FLOAT",
			  "tensorShape": {
				"dim": [
				  {
					"size": "1"
				  },
				  {
					"size": "1"
				  },
				  {
					"size": "128"
				  },
				  {
					"size": "256"
				  }
				]
			  }
			}
		  },
		  "dtype": {
			"type": "DT_FLOAT"
		  }
		}
	  },
	  {
		"name": "ae_encoder/res8/separable_conv2d_6/depthwise_kernel",
		"op": "Const",
		"attr": {
		  "value": {
			"tensor": {
			  "dtype": "DT_FLOAT",
			  "tensorShape": {
				"dim": [
				  {
					"size": "3"
				  },
				  {
					"size": "3"
				  },
				  {
					"size": "128"
				  },
				  {
					"size": "1"
				  }
				]
			  }
			}
		  },
		  "dtype": {
			"type": "DT_FLOAT"
		  }
		}
	  },
	  {
		"name": "ae_encoder/res8/separable_conv2d_6/pointwise_kernel",
		"op": "Const",
		"attr": {
		  "value": {
			"tensor": {
			  "dtype": "DT_FLOAT",
			  "tensorShape": {
				"dim": [
				  {
					"size": "1"
				  },
				  {
					"size": "1"
				  },
				  {
					"size": "128"
				  },
				  {
					"size": "256"
				  }
				]
			  }
			}
		  },
		  "dtype": {
			"type": "DT_FLOAT"
		  }
		}
	  },
	  {
		"name": "ae_encoder/res8/BatchNorm/Const",
		"op": "Const",
		"attr": {
		  "value": {
			"tensor": {
			  "dtype": "DT_FLOAT",
			  "tensorShape": {
				"dim": [
				  {
					"size": "256"
				  }
				]
			  }
			}
		  },
		  "dtype": {
			"type": "DT_FLOAT"
		  }
		}
	  },
	  {
		"name": "ae_encoder/res8/BatchNorm/beta",
		"op": "Const",
		"attr": {
		  "value": {
			"tensor": {
			  "dtype": "DT_FLOAT",
			  "tensorShape": {
				"dim": [
				  {
					"size": "256"
				  }
				]
			  }
			}
		  },
		  "dtype": {
			"type": "DT_FLOAT"
		  }
		}
	  },
	  {
		"name": "ae_encoder/res8/conv2d_13/kernel",
		"op": "Const",
		"attr": {
		  "value": {
			"tensor": {
			  "dtype": "DT_FLOAT",
			  "tensorShape": {
				"dim": [
				  {
					"size": "1"
				  },
				  {
					"size": "1"
				  },
				  {
					"size": "256"
				  },
				  {
					"size": "256"
				  }
				]
			  }
			}
		  },
		  "dtype": {
			"type": "DT_FLOAT"
		  }
		}
	  },
	  {
		"name": "ae_decoder/res8/conv2d_27/kernel",
		"op": "Const",
		"attr": {
		  "value": {
			"tensor": {
			  "dtype": "DT_FLOAT",
			  "tensorShape": {
				"dim": [
				  {
					"size": "1"
				  },
				  {
					"size": "1"
				  },
				  {
					"size": "64"
				  },
				  {
					"size": "64"
				  }
				]
			  }
			}
		  },
		  "dtype": {
			"type": "DT_FLOAT"
		  }
		}
	  },
	  {
		"name": "ae_encoder/res8/BatchNorm_1/beta",
		"op": "Const",
		"attr": {
		  "value": {
			"tensor": {
			  "dtype": "DT_FLOAT",
			  "tensorShape": {
				"dim": [
				  {
					"size": "256"
				  }
				]
			  }
			}
		  },
		  "dtype": {
			"type": "DT_FLOAT"
		  }
		}
	  },
	  {
		"name": "ae_encoder/res8/BatchNorm_2/beta",
		"op": "Const",
		"attr": {
		  "value": {
			"tensor": {
			  "dtype": "DT_FLOAT",
			  "tensorShape": {
				"dim": [
				  {
					"size": "256"
				  }
				]
			  }
			}
		  },
		  "dtype": {
			"type": "DT_FLOAT"
		  }
		}
	  },
	  {
		"name": "ae_encoder/res9/conv2d_14/kernel",
		"op": "Const",
		"attr": {
		  "value": {
			"tensor": {
			  "dtype": "DT_FLOAT",
			  "tensorShape": {
				"dim": [
				  {
					"size": "1"
				  },
				  {
					"size": "1"
				  },
				  {
					"size": "256"
				  },
				  {
					"size": "256"
				  }
				]
			  }
			}
		  },
		  "dtype": {
			"type": "DT_FLOAT"
		  }
		}
	  },
	  {
		"name": "ae_encoder/res9/separable_conv2d_7/depthwise_kernel",
		"op": "Const",
		"attr": {
		  "value": {
			"tensor": {
			  "dtype": "DT_FLOAT",
			  "tensorShape": {
				"dim": [
				  {
					"size": "3"
				  },
				  {
					"size": "3"
				  },
				  {
					"size": "256"
				  },
				  {
					"size": "1"
				  }
				]
			  }
			}
		  },
		  "dtype": {
			"type": "DT_FLOAT"
		  }
		}
	  },
	  {
		"name": "ae_decoder/res8/BatchNorm_1/beta",
		"op": "Const",
		"attr": {
		  "value": {
			"tensor": {
			  "dtype": "DT_FLOAT",
			  "tensorShape": {
				"dim": [
				  {
					"size": "64"
				  }
				]
			  }
			}
		  },
		  "dtype": {
			"type": "DT_FLOAT"
		  }
		}
	  },
	  {
		"name": "ae_encoder/res9/separable_conv2d_7/pointwise_kernel",
		"op": "Const",
		"attr": {
		  "value": {
			"tensor": {
			  "dtype": "DT_FLOAT",
			  "tensorShape": {
				"dim": [
				  {
					"size": "1"
				  },
				  {
					"size": "1"
				  },
				  {
					"size": "256"
				  },
				  {
					"size": "256"
				  }
				]
			  }
			}
		  },
		  "dtype": {
			"type": "DT_FLOAT"
		  }
		}
	  },
	  {
		"name": "ae_encoder/res9/BatchNorm/beta",
		"op": "Const",
		"attr": {
		  "value": {
			"tensor": {
			  "dtype": "DT_FLOAT",
			  "tensorShape": {
				"dim": [
				  {
					"size": "256"
				  }
				]
			  }
			}
		  },
		  "dtype": {
			"type": "DT_FLOAT"
		  }
		}
	  },
	  {
		"name": "ae_encoder/res9/conv2d_15/kernel",
		"op": "Const",
		"attr": {
		  "value": {
			"tensor": {
			  "dtype": "DT_FLOAT",
			  "tensorShape": {
				"dim": [
				  {
					"size": "1"
				  },
				  {
					"size": "1"
				  },
				  {
					"size": "256"
				  },
				  {
					"size": "256"
				  }
				]
			  }
			}
		  },
		  "dtype": {
			"type": "DT_FLOAT"
		  }
		}
	  },
	  {
		"name": "ae_encoder/res9/BatchNorm_1/beta",
		"op": "Const",
		"attr": {
		  "value": {
			"tensor": {
			  "dtype": "DT_FLOAT",
			  "tensorShape": {
				"dim": [
				  {
					"size": "256"
				  }
				]
			  }
			}
		  },
		  "dtype": {
			"type": "DT_FLOAT"
		  }
		}
	  },
	  {
		"name": "ae_encoder/res9/BatchNorm_2/beta",
		"op": "Const",
		"attr": {
		  "value": {
			"tensor": {
			  "dtype": "DT_FLOAT",
			  "tensorShape": {
				"dim": [
				  {
					"size": "256"
				  }
				]
			  }
			}
		  },
		  "dtype": {
			"type": "DT_FLOAT"
		  }
		}
	  },
	  {
		"name": "ae_encoder/Reshape/shape",
		"op": "Const",
		"attr": {
		  "value": {
			"tensor": {
			  "dtype": "DT_INT32",
			  "tensorShape": {
				"dim": [
				  {
					"size": "2"
				  }
				]
			  }
			}
		  },
		  "dtype": {
			"type": "DT_INT32"
		  }
		}
	  },
	  {
		"name": "ae_encoder/fc_bottleneck/fc/kernel",
		"op": "Const",
		"attr": {
		  "value": {
			"tensor": {
			  "dtype": "DT_FLOAT",
			  "tensorShape": {
				"dim": [
				  {
					"size": "4096"
				  },
				  {
					"size": "256"
				  }
				]
			  }
			}
		  },
		  "dtype": {
			"type": "DT_FLOAT"
		  }
		}
	  },
	  {
		"name": "ConstantFolding/ae_decoder/truediv_recip",
		"op": "Const",
		"attr": {
		  "value": {
			"tensor": {
			  "dtype": "DT_FLOAT",
			  "tensorShape": {}
			}
		  },
		  "dtype": {
			"type": "DT_FLOAT"
		  }
		}
	  },
	  {
		"name": "ae_encoder/fc_bottleneck/fc/bias",
		"op": "Const",
		"attr": {
		  "value": {
			"tensor": {
			  "dtype": "DT_FLOAT",
			  "tensorShape": {
				"dim": [
				  {
					"size": "256"
				  }
				]
			  }
			}
		  },
		  "dtype": {
			"type": "DT_FLOAT"
		  }
		}
	  },
	  {
		"name": "ae_decoder/res8/BatchNorm_2/beta",
		"op": "Const",
		"attr": {
		  "value": {
			"tensor": {
			  "dtype": "DT_FLOAT",
			  "tensorShape": {
				"dim": [
				  {
					"size": "64"
				  }
				]
			  }
			}
		  },
		  "dtype": {
			"type": "DT_FLOAT"
		  }
		}
	  },
	  {
		"name": "ae_encoder/fc_bottleneck/BatchNorm/Reshape/shape",
		"op": "Const",
		"attr": {
		  "value": {
			"tensor": {
			  "dtype": "DT_INT32",
			  "tensorShape": {
				"dim": [
				  {
					"size": "4"
				  }
				]
			  }
			}
		  },
		  "dtype": {
			"type": "DT_INT32"
		  }
		}
	  },
	  {
		"name": "ae_encoder/fc_bottleneck/BatchNorm/beta",
		"op": "Const",
		"attr": {
		  "value": {
			"tensor": {
			  "dtype": "DT_FLOAT",
			  "tensorShape": {
				"dim": [
				  {
					"size": "256"
				  }
				]
			  }
			}
		  },
		  "dtype": {
			"type": "DT_FLOAT"
		  }
		}
	  },
	  {
		"name": "Placeholder_1",
		"op": "Placeholder",
		"attr": {
		  "shape": {
			"shape": {}
		  },
		  "dtype": {
			"type": "DT_FLOAT"
		  }
		}
	  },
	  {
		"name": "strided_slice/stack",
		"op": "Const",
		"attr": {
		  "value": {
			"tensor": {
			  "dtype": "DT_INT32",
			  "tensorShape": {
				"dim": [
				  {
					"size": "1"
				  }
				]
			  }
			}
		  },
		  "dtype": {
			"type": "DT_INT32"
		  }
		}
	  },
	  {
		"name": "strided_slice/stack_2",
		"op": "Const",
		"attr": {
		  "value": {
			"tensor": {
			  "dtype": "DT_INT32",
			  "tensorShape": {
				"dim": [
				  {
					"size": "1"
				  }
				]
			  }
			}
		  },
		  "dtype": {
			"type": "DT_INT32"
		  }
		}
	  },
	  {
		"name": "sub/x",
		"op": "Const",
		"attr": {
		  "value": {
			"tensor": {
			  "dtype": "DT_FLOAT",
			  "tensorShape": {}
			}
		  },
		  "dtype": {
			"type": "DT_FLOAT"
		  }
		}
	  },
	  {
		"name": "strided_slice_1/stack",
		"op": "Const",
		"attr": {
		  "value": {
			"tensor": {
			  "dtype": "DT_INT32",
			  "tensorShape": {
				"dim": [
				  {
					"size": "1"
				  }
				]
			  }
			}
		  },
		  "dtype": {
			"type": "DT_INT32"
		  }
		}
	  },
	  {
		"name": "ae_decoder/fc_recon/fc/kernel",
		"op": "Const",
		"attr": {
		  "value": {
			"tensor": {
			  "dtype": "DT_FLOAT",
			  "tensorShape": {
				"dim": [
				  {
					"size": "256"
				  },
				  {
					"size": "4096"
				  }
				]
			  }
			}
		  },
		  "dtype": {
			"type": "DT_FLOAT"
		  }
		}
	  },
	  {
		"name": "ae_decoder/fc_recon/fc/bias",
		"op": "Const",
		"attr": {
		  "value": {
			"tensor": {
			  "dtype": "DT_FLOAT",
			  "tensorShape": {
				"dim": [
				  {
					"size": "4096"
				  }
				]
			  }
			}
		  },
		  "dtype": {
			"type": "DT_FLOAT"
		  }
		}
	  },
	  {
		"name": "ae_decoder/fc_recon/BatchNorm/Reshape/shape",
		"op": "Const",
		"attr": {
		  "value": {
			"tensor": {
			  "dtype": "DT_INT32",
			  "tensorShape": {
				"dim": [
				  {
					"size": "4"
				  }
				]
			  }
			}
		  },
		  "dtype": {
			"type": "DT_INT32"
		  }
		}
	  },
	  {
		"name": "ae_decoder/fc_recon/BatchNorm/beta",
		"op": "Const",
		"attr": {
		  "value": {
			"tensor": {
			  "dtype": "DT_FLOAT",
			  "tensorShape": {
				"dim": [
				  {
					"size": "4096"
				  }
				]
			  }
			}
		  },
		  "dtype": {
			"type": "DT_FLOAT"
		  }
		}
	  },
	  {
		"name": "ae_decoder/fc_recon/BatchNorm/Const",
		"op": "Const",
		"attr": {
		  "value": {
			"tensor": {
			  "dtype": "DT_FLOAT",
			  "tensorShape": {
				"dim": [
				  {
					"size": "4096"
				  }
				]
			  }
			}
		  },
		  "dtype": {
			"type": "DT_FLOAT"
		  }
		}
	  },
	  {
		"name": "ae_decoder/Reshape/shape",
		"op": "Const",
		"attr": {
		  "value": {
			"tensor": {
			  "dtype": "DT_INT32",
			  "tensorShape": {
				"dim": [
				  {
					"size": "4"
				  }
				]
			  }
			}
		  },
		  "dtype": {
			"type": "DT_INT32"
		  }
		}
	  },
	  {
		"name": "ae_decoder/res1/conv2d_16/kernel",
		"op": "Const",
		"attr": {
		  "value": {
			"tensor": {
			  "dtype": "DT_FLOAT",
			  "tensorShape": {
				"dim": [
				  {
					"size": "1"
				  },
				  {
					"size": "1"
				  },
				  {
					"size": "256"
				  },
				  {
					"size": "256"
				  }
				]
			  }
			}
		  },
		  "dtype": {
			"type": "DT_FLOAT"
		  }
		}
	  },
	  {
		"name": "ae_decoder/res1/separable_conv2d_8/depthwise_kernel",
		"op": "Const",
		"attr": {
		  "value": {
			"tensor": {
			  "dtype": "DT_FLOAT",
			  "tensorShape": {
				"dim": [
				  {
					"size": "3"
				  },
				  {
					"size": "3"
				  },
				  {
					"size": "256"
				  },
				  {
					"size": "1"
				  }
				]
			  }
			}
		  },
		  "dtype": {
			"type": "DT_FLOAT"
		  }
		}
	  },
	  {
		"name": "ae_decoder/res1/separable_conv2d_8/pointwise_kernel",
		"op": "Const",
		"attr": {
		  "value": {
			"tensor": {
			  "dtype": "DT_FLOAT",
			  "tensorShape": {
				"dim": [
				  {
					"size": "1"
				  },
				  {
					"size": "1"
				  },
				  {
					"size": "256"
				  },
				  {
					"size": "256"
				  }
				]
			  }
			}
		  },
		  "dtype": {
			"type": "DT_FLOAT"
		  }
		}
	  },
	  {
		"name": "ae_decoder/res1/BatchNorm/beta",
		"op": "Const",
		"attr": {
		  "value": {
			"tensor": {
			  "dtype": "DT_FLOAT",
			  "tensorShape": {
				"dim": [
				  {
					"size": "256"
				  }
				]
			  }
			}
		  },
		  "dtype": {
			"type": "DT_FLOAT"
		  }
		}
	  },
	  {
		"name": "ae_decoder/up_sampling2d_3/strided_slice/stack_1",
		"op": "Const",
		"attr": {
		  "value": {
			"tensor": {
			  "dtype": "DT_INT32",
			  "tensorShape": {
				"dim": [
				  {
					"size": "1"
				  }
				]
			  }
			}
		  },
		  "dtype": {
			"type": "DT_INT32"
		  }
		}
	  },
	  {
		"name": "ae_decoder/res1/conv2d_17/kernel",
		"op": "Const",
		"attr": {
		  "value": {
			"tensor": {
			  "dtype": "DT_FLOAT",
			  "tensorShape": {
				"dim": [
				  {
					"size": "1"
				  },
				  {
					"size": "1"
				  },
				  {
					"size": "256"
				  },
				  {
					"size": "256"
				  }
				]
			  }
			}
		  },
		  "dtype": {
			"type": "DT_FLOAT"
		  }
		}
	  },
	  {
		"name": "ae_decoder/res1/BatchNorm_1/beta",
		"op": "Const",
		"attr": {
		  "value": {
			"tensor": {
			  "dtype": "DT_FLOAT",
			  "tensorShape": {
				"dim": [
				  {
					"size": "256"
				  }
				]
			  }
			}
		  },
		  "dtype": {
			"type": "DT_FLOAT"
		  }
		}
	  },
	  {
		"name": "ae_decoder/res1/BatchNorm_2/beta",
		"op": "Const",
		"attr": {
		  "value": {
			"tensor": {
			  "dtype": "DT_FLOAT",
			  "tensorShape": {
				"dim": [
				  {
					"size": "256"
				  }
				]
			  }
			}
		  },
		  "dtype": {
			"type": "DT_FLOAT"
		  }
		}
	  },
	  {
		"name": "ae_decoder/up_sampling2d_3/Const",
		"op": "Const",
		"attr": {
		  "value": {
			"tensor": {
			  "dtype": "DT_INT32",
			  "tensorShape": {
				"dim": [
				  {
					"size": "2"
				  }
				]
			  }
			}
		  },
		  "dtype": {
			"type": "DT_INT32"
		  }
		}
	  },
	  {
		"name": "ae_decoder/res2/conv2d_18/kernel",
		"op": "Const",
		"attr": {
		  "value": {
			"tensor": {
			  "dtype": "DT_FLOAT",
			  "tensorShape": {
				"dim": [
				  {
					"size": "1"
				  },
				  {
					"size": "1"
				  },
				  {
					"size": "256"
				  },
				  {
					"size": "256"
				  }
				]
			  }
			}
		  },
		  "dtype": {
			"type": "DT_FLOAT"
		  }
		}
	  },
	  {
		"name": "ae_decoder/res2/separable_conv2d_9/depthwise_kernel",
		"op": "Const",
		"attr": {
		  "value": {
			"tensor": {
			  "dtype": "DT_FLOAT",
			  "tensorShape": {
				"dim": [
				  {
					"size": "3"
				  },
				  {
					"size": "3"
				  },
				  {
					"size": "256"
				  },
				  {
					"size": "1"
				  }
				]
			  }
			}
		  },
		  "dtype": {
			"type": "DT_FLOAT"
		  }
		}
	  },
	  {
		"name": "ae_decoder/res2/separable_conv2d_9/pointwise_kernel",
		"op": "Const",
		"attr": {
		  "value": {
			"tensor": {
			  "dtype": "DT_FLOAT",
			  "tensorShape": {
				"dim": [
				  {
					"size": "1"
				  },
				  {
					"size": "1"
				  },
				  {
					"size": "256"
				  },
				  {
					"size": "256"
				  }
				]
			  }
			}
		  },
		  "dtype": {
			"type": "DT_FLOAT"
		  }
		}
	  },
	  {
		"name": "ae_decoder/res9/conv2d_28/kernel",
		"op": "Const",
		"attr": {
		  "value": {
			"tensor": {
			  "dtype": "DT_FLOAT",
			  "tensorShape": {
				"dim": [
				  {
					"size": "1"
				  },
				  {
					"size": "1"
				  },
				  {
					"size": "64"
				  },
				  {
					"size": "32"
				  }
				]
			  }
			}
		  },
		  "dtype": {
			"type": "DT_FLOAT"
		  }
		}
	  },
	  {
		"name": "ae_decoder/res2/BatchNorm/beta",
		"op": "Const",
		"attr": {
		  "value": {
			"tensor": {
			  "dtype": "DT_FLOAT",
			  "tensorShape": {
				"dim": [
				  {
					"size": "256"
				  }
				]
			  }
			}
		  },
		  "dtype": {
			"type": "DT_FLOAT"
		  }
		}
	  },
	  {
		"name": "ae_decoder/conv10/conv/kernel",
		"op": "Const",
		"attr": {
		  "value": {
			"tensor": {
			  "dtype": "DT_FLOAT",
			  "tensorShape": {
				"dim": [
				  {
					"size": "7"
				  },
				  {
					"size": "7"
				  },
				  {
					"size": "32"
				  },
				  {
					"size": "1"
				  }
				]
			  }
			}
		  },
		  "dtype": {
			"type": "DT_FLOAT"
		  }
		}
	  },
	  {
		"name": "ae_decoder/res2/conv2d_19/kernel",
		"op": "Const",
		"attr": {
		  "value": {
			"tensor": {
			  "dtype": "DT_FLOAT",
			  "tensorShape": {
				"dim": [
				  {
					"size": "1"
				  },
				  {
					"size": "1"
				  },
				  {
					"size": "256"
				  },
				  {
					"size": "256"
				  }
				]
			  }
			}
		  },
		  "dtype": {
			"type": "DT_FLOAT"
		  }
		}
	  },
	  {
		"name": "ae_decoder/res2/BatchNorm_1/beta",
		"op": "Const",
		"attr": {
		  "value": {
			"tensor": {
			  "dtype": "DT_FLOAT",
			  "tensorShape": {
				"dim": [
				  {
					"size": "256"
				  }
				]
			  }
			}
		  },
		  "dtype": {
			"type": "DT_FLOAT"
		  }
		}
	  },
	  {
		"name": "ae_decoder/res9/separable_conv2d_14/depthwise_kernel",
		"op": "Const",
		"attr": {
		  "value": {
			"tensor": {
			  "dtype": "DT_FLOAT",
			  "tensorShape": {
				"dim": [
				  {
					"size": "3"
				  },
				  {
					"size": "3"
				  },
				  {
					"size": "64"
				  },
				  {
					"size": "1"
				  }
				]
			  }
			}
		  },
		  "dtype": {
			"type": "DT_FLOAT"
		  }
		}
	  },
	  {
		"name": "ae_decoder/res2/BatchNorm_2/beta",
		"op": "Const",
		"attr": {
		  "value": {
			"tensor": {
			  "dtype": "DT_FLOAT",
			  "tensorShape": {
				"dim": [
				  {
					"size": "256"
				  }
				]
			  }
			}
		  },
		  "dtype": {
			"type": "DT_FLOAT"
		  }
		}
	  },
	  {
		"name": "ae_decoder/res3/conv2d_20/kernel",
		"op": "Const",
		"attr": {
		  "value": {
			"tensor": {
			  "dtype": "DT_FLOAT",
			  "tensorShape": {
				"dim": [
				  {
					"size": "1"
				  },
				  {
					"size": "1"
				  },
				  {
					"size": "256"
				  },
				  {
					"size": "128"
				  }
				]
			  }
			}
		  },
		  "dtype": {
			"type": "DT_FLOAT"
		  }
		}
	  },
	  {
		"name": "ae_decoder/res3/separable_conv2d_10/depthwise_kernel",
		"op": "Const",
		"attr": {
		  "value": {
			"tensor": {
			  "dtype": "DT_FLOAT",
			  "tensorShape": {
				"dim": [
				  {
					"size": "3"
				  },
				  {
					"size": "3"
				  },
				  {
					"size": "256"
				  },
				  {
					"size": "1"
				  }
				]
			  }
			}
		  },
		  "dtype": {
			"type": "DT_FLOAT"
		  }
		}
	  },
	  {
		"name": "ae_decoder/res9/separable_conv2d_14/pointwise_kernel",
		"op": "Const",
		"attr": {
		  "value": {
			"tensor": {
			  "dtype": "DT_FLOAT",
			  "tensorShape": {
				"dim": [
				  {
					"size": "1"
				  },
				  {
					"size": "1"
				  },
				  {
					"size": "64"
				  },
				  {
					"size": "32"
				  }
				]
			  }
			}
		  },
		  "dtype": {
			"type": "DT_FLOAT"
		  }
		}
	  },
	  {
		"name": "ae_decoder/res3/separable_conv2d_10/pointwise_kernel",
		"op": "Const",
		"attr": {
		  "value": {
			"tensor": {
			  "dtype": "DT_FLOAT",
			  "tensorShape": {
				"dim": [
				  {
					"size": "1"
				  },
				  {
					"size": "1"
				  },
				  {
					"size": "256"
				  },
				  {
					"size": "128"
				  }
				]
			  }
			}
		  },
		  "dtype": {
			"type": "DT_FLOAT"
		  }
		}
	  },
	  {
		"name": "ae_decoder/res3/BatchNorm/beta",
		"op": "Const",
		"attr": {
		  "value": {
			"tensor": {
			  "dtype": "DT_FLOAT",
			  "tensorShape": {
				"dim": [
				  {
					"size": "128"
				  }
				]
			  }
			}
		  },
		  "dtype": {
			"type": "DT_FLOAT"
		  }
		}
	  },
	  {
		"name": "ae_decoder/res3/conv2d_21/kernel",
		"op": "Const",
		"attr": {
		  "value": {
			"tensor": {
			  "dtype": "DT_FLOAT",
			  "tensorShape": {
				"dim": [
				  {
					"size": "1"
				  },
				  {
					"size": "1"
				  },
				  {
					"size": "128"
				  },
				  {
					"size": "128"
				  }
				]
			  }
			}
		  },
		  "dtype": {
			"type": "DT_FLOAT"
		  }
		}
	  },
	  {
		"name": "ae_decoder/res3/BatchNorm_1/beta",
		"op": "Const",
		"attr": {
		  "value": {
			"tensor": {
			  "dtype": "DT_FLOAT",
			  "tensorShape": {
				"dim": [
				  {
					"size": "128"
				  }
				]
			  }
			}
		  },
		  "dtype": {
			"type": "DT_FLOAT"
		  }
		}
	  },
	  {
		"name": "ae_decoder/res9/BatchNorm/beta",
		"op": "Const",
		"attr": {
		  "value": {
			"tensor": {
			  "dtype": "DT_FLOAT",
			  "tensorShape": {
				"dim": [
				  {
					"size": "32"
				  }
				]
			  }
			}
		  },
		  "dtype": {
			"type": "DT_FLOAT"
		  }
		}
	  },
	  {
		"name": "ae_decoder/res3/BatchNorm_2/beta",
		"op": "Const",
		"attr": {
		  "value": {
			"tensor": {
			  "dtype": "DT_FLOAT",
			  "tensorShape": {
				"dim": [
				  {
					"size": "128"
				  }
				]
			  }
			}
		  },
		  "dtype": {
			"type": "DT_FLOAT"
		  }
		}
	  },
	  {
		"name": "ae_decoder/res4/conv2d_22/kernel",
		"op": "Const",
		"attr": {
		  "value": {
			"tensor": {
			  "dtype": "DT_FLOAT",
			  "tensorShape": {
				"dim": [
				  {
					"size": "1"
				  },
				  {
					"size": "1"
				  },
				  {
					"size": "128"
				  },
				  {
					"size": "128"
				  }
				]
			  }
			}
		  },
		  "dtype": {
			"type": "DT_FLOAT"
		  }
		}
	  },
	  {
		"name": "ae_decoder/res4/separable_conv2d_11/depthwise_kernel",
		"op": "Const",
		"attr": {
		  "value": {
			"tensor": {
			  "dtype": "DT_FLOAT",
			  "tensorShape": {
				"dim": [
				  {
					"size": "3"
				  },
				  {
					"size": "3"
				  },
				  {
					"size": "128"
				  },
				  {
					"size": "1"
				  }
				]
			  }
			}
		  },
		  "dtype": {
			"type": "DT_FLOAT"
		  }
		}
	  },
	  {
		"name": "ae_decoder/res4/separable_conv2d_11/pointwise_kernel",
		"op": "Const",
		"attr": {
		  "value": {
			"tensor": {
			  "dtype": "DT_FLOAT",
			  "tensorShape": {
				"dim": [
				  {
					"size": "1"
				  },
				  {
					"size": "1"
				  },
				  {
					"size": "128"
				  },
				  {
					"size": "128"
				  }
				]
			  }
			}
		  },
		  "dtype": {
			"type": "DT_FLOAT"
		  }
		}
	  },
	  {
		"name": "ae_decoder/res4/BatchNorm/beta",
		"op": "Const",
		"attr": {
		  "value": {
			"tensor": {
			  "dtype": "DT_FLOAT",
			  "tensorShape": {
				"dim": [
				  {
					"size": "128"
				  }
				]
			  }
			}
		  },
		  "dtype": {
			"type": "DT_FLOAT"
		  }
		}
	  },
	  {
		"name": "ae_decoder/res4/conv2d_23/kernel",
		"op": "Const",
		"attr": {
		  "value": {
			"tensor": {
			  "dtype": "DT_FLOAT",
			  "tensorShape": {
				"dim": [
				  {
					"size": "1"
				  },
				  {
					"size": "1"
				  },
				  {
					"size": "128"
				  },
				  {
					"size": "128"
				  }
				]
			  }
			}
		  },
		  "dtype": {
			"type": "DT_FLOAT"
		  }
		}
	  },
	  {
		"name": "ae_decoder/res9/conv2d_29/kernel",
		"op": "Const",
		"attr": {
		  "value": {
			"tensor": {
			  "dtype": "DT_FLOAT",
			  "tensorShape": {
				"dim": [
				  {
					"size": "1"
				  },
				  {
					"size": "1"
				  },
				  {
					"size": "32"
				  },
				  {
					"size": "32"
				  }
				]
			  }
			}
		  },
		  "dtype": {
			"type": "DT_FLOAT"
		  }
		}
	  },
	  {
		"name": "ae_decoder/res4/BatchNorm_1/beta",
		"op": "Const",
		"attr": {
		  "value": {
			"tensor": {
			  "dtype": "DT_FLOAT",
			  "tensorShape": {
				"dim": [
				  {
					"size": "128"
				  }
				]
			  }
			}
		  },
		  "dtype": {
			"type": "DT_FLOAT"
		  }
		}
	  },
	  {
		"name": "ae_decoder/res4/BatchNorm_2/beta",
		"op": "Const",
		"attr": {
		  "value": {
			"tensor": {
			  "dtype": "DT_FLOAT",
			  "tensorShape": {
				"dim": [
				  {
					"size": "128"
				  }
				]
			  }
			}
		  },
		  "dtype": {
			"type": "DT_FLOAT"
		  }
		}
	  },
	  {
		"name": "ae_decoder/res6/conv2d_24/kernel",
		"op": "Const",
		"attr": {
		  "value": {
			"tensor": {
			  "dtype": "DT_FLOAT",
			  "tensorShape": {
				"dim": [
				  {
					"size": "1"
				  },
				  {
					"size": "1"
				  },
				  {
					"size": "128"
				  },
				  {
					"size": "64"
				  }
				]
			  }
			}
		  },
		  "dtype": {
			"type": "DT_FLOAT"
		  }
		}
	  },
	  {
		"name": "Reshape",
		"op": "Reshape",
		"input": [
		  "Placeholder",
		  "Reshape/shape"
		],
		"attr": {
		  "T": {
			"type": "DT_FLOAT"
		  },
		  "Tshape": {
			"type": "DT_INT32"
		  }
		}
	  },
	  {
		"name": "sub",
		"op": "Sub",
		"input": [
		  "sub/x",
		  "Placeholder_1"
		],
		"attr": {
		  "T": {
			"type": "DT_FLOAT"
		  }
		}
	  },
	  {
		"name": "ae_encoder/res1/conv2d/Conv2D",
		"op": "Conv2D",
		"input": [
		  "Reshape",
		  "ae_encoder/res1/conv2d/kernel"
		],
		"device": "/device:CPU:0",
		"attr": {
		  "dilations": {
			"list": {
			  "i": [
				"1",
				"1",
				"1",
				"1"
			  ]
			}
		  },
		  "T": {
			"type": "DT_FLOAT"
		  },
		  "strides": {
			"list": {
			  "i": [
				"1",
				"2",
				"2",
				"1"
			  ]
			}
		  },
		  "data_format": {
			"s": "TkhXQw=="
		  },
		  "use_cudnn_on_gpu": {
			"b": true
		  },
		  "explicit_paddings": {
			"list": {}
		  },
		  "padding": {
			"s": "U0FNRQ=="
		  }
		}
	  },
	  {
		"name": "ae_encoder/res1/separable_conv2d/separable_conv2d/depthwise",
		"op": "DepthwiseConv2dNative",
		"input": [
		  "Reshape",
		  "ae_encoder/res1/separable_conv2d/depthwise_kernel"
		],
		"attr": {
		  "padding": {
			"s": "U0FNRQ=="
		  },
		  "dilations": {
			"list": {
			  "i": [
				"1",
				"1",
				"1",
				"1"
			  ]
			}
		  },
		  "T": {
			"type": "DT_FLOAT"
		  },
		  "strides": {
			"list": {
			  "i": [
				"1",
				"2",
				"2",
				"1"
			  ]
			}
		  },
		  "data_format": {
			"s": "TkhXQw=="
		  }
		}
	  },
	  {
		"name": "ae_encoder/res1/BatchNorm_2/FusedBatchNormV3",
		"op": "FusedBatchNormV3",
		"input": [
		  "ae_encoder/res1/conv2d/Conv2D",
		  "ae_encoder/res1/BatchNorm/Const",
		  "ae_encoder/res1/BatchNorm_2/beta",
		  "ae_encoder/res1/BatchNorm/Const_1",
		  "ae_encoder/res1/BatchNorm/Const_1"
		],
		"attr": {
		  "epsilon": {
			"f": 0.0010000000474974513
		  },
		  "T": {
			"type": "DT_FLOAT"
		  },
		  "U": {
			"type": "DT_FLOAT"
		  },
		  "data_format": {
			"s": "TkhXQw=="
		  },
		  "is_training": {
			"b": true
		  }
		}
	  },
	  {
		"name": "ae_encoder/res1/separable_conv2d/separable_conv2d",
		"op": "Conv2D",
		"input": [
