{"format": "graph-model", "generatedBy": "1.15.0", "convertedBy": "TensorFlow.js Converter v1.4.0", "userDefinedMetadata": {"signature": {"outputs": {"ae_decoder/recon_norm": {"name": "ae_decoder/recon_norm"}, "ae_encoder/fc_bottleneck/fc_lrelu": {"name": "ae_encoder/fc_bottleneck/fc_lrelu"}}}}, "modelTopology": {"node": [{"name": "Placeholder", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "64"}, {"size": "64"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Reshape/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "ae_encoder/res1/conv2d/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ae_encoder/res1/separable_conv2d/depthwise_kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ae_encoder/res1/separable_conv2d/pointwise_kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ae_decoder/up_sampling2d_3/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "ae_encoder/res1/Mean/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "ae_encoder/res1/conv2d_1/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "32"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ae_decoder/up_sampling2d_3/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "ae_encoder/res2/conv2d_2/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "32"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ae_encoder/res2/separable_conv2d_1/depthwise_kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ae_encoder/res2/separable_conv2d_1/pointwise_kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "32"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ae_decoder/up_sampling2d_3/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "ae_encoder/res2/conv2d_3/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "32"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ae_encoder/res3/conv2d_4/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "32"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ae_encoder/res3/separable_conv2d_2/depthwise_kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ae_decoder/res9/conv2d_28/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "64"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ae_encoder/res3/separable_conv2d_2/pointwise_kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "32"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ae_encoder/res3/conv2d_5/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ae_encoder/res4/conv2d_6/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ae_decoder/res9/separable_conv2d_14/depthwise_kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ae_encoder/res4/separable_conv2d_3/depthwise_kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ae_decoder/add/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ae_encoder/res4/separable_conv2d_3/pointwise_kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ae_encoder/res4/conv2d_7/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ae_decoder/res9/separable_conv2d_14/pointwise_kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "64"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ae_encoder/res6/conv2d_8/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "64"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ae_encoder/res6/separable_conv2d_4/depthwise_kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ae_encoder/res6/separable_conv2d_4/pointwise_kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "64"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ae_encoder/res6/conv2d_9/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ae_encoder/res7/conv2d_10/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ae_encoder/res7/separable_conv2d_5/depthwise_kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ae_encoder/res7/separable_conv2d_5/pointwise_kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ae_encoder/res7/conv2d_11/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ae_encoder/res8/conv2d_12/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ae_encoder/res8/separable_conv2d_6/depthwise_kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ae_encoder/res8/separable_conv2d_6/pointwise_kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ae_encoder/res8/conv2d_13/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "256"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ae_encoder/res9/conv2d_14/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "256"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ae_encoder/res9/separable_conv2d_7/depthwise_kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ae_encoder/res9/separable_conv2d_7/pointwise_kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "256"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ae_decoder/res9/conv2d_29/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "32"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ae_encoder/res9/conv2d_15/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "256"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ae_encoder/Reshape/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "ae_encoder/fc_bottleneck/fc/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4096"}, {"size": "384"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/ae_decoder/recon_norm_recip", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ae_encoder/fc_bottleneck/fc/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "384"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Placeholder_1", "op": "Placeholder", "attr": {"shape": {"shape": {}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "ae_decoder/fc_recon/fc/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "384"}, {"size": "4096"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ae_decoder/fc_recon/fc/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4096"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ae_decoder/Reshape/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "ae_decoder/res1/conv2d_16/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "256"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ae_decoder/res1/separable_conv2d_8/depthwise_kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ae_decoder/res1/separable_conv2d_8/pointwise_kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "256"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ae_decoder/res1/conv2d_17/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "256"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ae_decoder/res2/conv2d_18/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "256"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ae_decoder/res2/separable_conv2d_9/depthwise_kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ae_decoder/res2/separable_conv2d_9/pointwise_kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "256"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ae_decoder/res2/conv2d_19/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "256"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ae_decoder/res3/conv2d_20/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "256"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ae_decoder/res3/separable_conv2d_10/depthwise_kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ae_decoder/res3/separable_conv2d_10/pointwise_kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "256"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ae_decoder/res3/conv2d_21/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ae_decoder/res4/conv2d_22/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ae_decoder/res4/separable_conv2d_11/depthwise_kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ae_decoder/res4/separable_conv2d_11/pointwise_kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ae_decoder/res4/conv2d_23/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ae_decoder/res6/conv2d_24/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ae_decoder/res6/separable_conv2d_12/depthwise_kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ae_decoder/res6/separable_conv2d_12/pointwise_kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ae_decoder/res6/conv2d_25/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ae_decoder/res8/conv2d_26/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ae_decoder/res8/separable_conv2d_13/depthwise_kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ae_decoder/conv10/conv/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "7"}, {"size": "7"}, {"size": "32"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ae_decoder/res8/separable_conv2d_13/pointwise_kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ae_decoder/res8/conv2d_27/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Reshape", "op": "Reshape", "input": ["Placeholder", "Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "sub", "op": "Sub", "input": ["ae_decoder/add/y", "Placeholder_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "ae_encoder/res1/conv2d/Conv2D", "op": "Conv2D", "input": ["Reshape", "ae_encoder/res1/conv2d/kernel"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}}}, {"name": "ae_encoder/res1/separable_conv2d/separable_conv2d/depthwise", "op": "DepthwiseConv2dNative", "input": ["Reshape", "ae_encoder/res1/separable_conv2d/depthwise_kernel"], "attr": {"padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}}}, {"name": "ae_encoder/res1/separable_conv2d/separable_conv2d", "op": "Conv2D", "input": ["ae_encoder/res1/separable_conv2d/separable_conv2d/depthwise", "ae_encoder/res1/separable_conv2d/pointwise_kernel"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "padding": {"s": "VkFMSUQ="}}}, {"name": "ae_encoder/res1/Mean", "op": "Mean", "input": ["ae_encoder/res1/separable_conv2d/separable_conv2d", "ae_encoder/res1/Mean/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "ae_encoder/res1/sub", "op": "Sub", "input": ["ae_encoder/res1/separable_conv2d/separable_conv2d", "ae_encoder/res1/Mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "ae_encoder/res1/reduce_std/reduce_variance/Mean", "op": "Mean", "input": ["ae_encoder/res1/sub", "ae_encoder/res1/Mean/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "ae_encoder/res1/reduce_std/reduce_variance/sub", "op": "SquaredDifference", "input": ["ae_encoder/res1/reduce_std/reduce_variance/Mean", "ae_encoder/res1/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "ae_encoder/res1/reduce_std/reduce_variance/Mean_1", "op": "Mean", "input": ["ae_encoder/res1/reduce_std/reduce_variance/sub", "ae_encoder/res1/Mean/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "ae_encoder/res1/reduce_std/Sqrt", "op": "Rsqrt", "input": ["ae_encoder/res1/reduce_std/reduce_variance/Mean_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "ae_encoder/res1/truediv", "op": "Mul", "input": ["ae_encoder/res1/reduce_std/Sqrt", "ae_encoder/res1/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "ae_encoder/res1/LeakyRelu", "op": "LeakyRelu", "input": ["ae_encoder/res1/truediv"], "attr": {"T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.20000000298023224}}}, {"name": "ae_encoder/res1/conv2d_1/Conv2D", "op": "Conv2D", "input": ["ae_encoder/res1/LeakyRelu", "ae_encoder/res1/conv2d_1/kernel"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}}}, {"name": "ae_encoder/res1/Mean_1", "op": "Mean", "input": ["ae_encoder/res1/conv2d_1/Conv2D", "ae_encoder/res1/Mean/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "ae_encoder/res1/sub_1", "op": "Sub", "input": ["ae_encoder/res1/separable_conv2d/separable_conv2d", "ae_encoder/res1/Mean_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "ae_encoder/res1/reduce_std_1/reduce_variance/Mean", "op": "Mean", "input": ["ae_encoder/res1/sub_1", "ae_encoder/res1/Mean/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "ae_encoder/res1/reduce_std_1/reduce_variance/sub", "op": "SquaredDifference", "input": ["ae_encoder/res1/reduce_std_1/reduce_variance/Mean", "ae_encoder/res1/sub_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "ae_encoder/res1/reduce_std_1/reduce_variance/Mean_1", "op": "Mean", "input": ["ae_encoder/res1/reduce_std_1/reduce_variance/sub", "ae_encoder/res1/Mean/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "ae_encoder/res1/reduce_std_1/Sqrt", "op": "Rsqrt", "input": ["ae_encoder/res1/reduce_std_1/reduce_variance/Mean_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "ae_encoder/res1/truediv_1", "op": "Mul", "input": ["ae_encoder/res1/reduce_std_1/Sqrt", "ae_encoder/res1/sub_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "ae_encoder/res1/LeakyRelu_1", "op": "LeakyRelu", "input": ["ae_encoder/res1/truediv_1"], "attr": {"T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.20000000298023224}}}, {"name": "ae_encoder/res1/add", "op": "AddV2", "input": ["ae_encoder/res1/LeakyRelu_1", "ae_encoder/res1/conv2d/Conv2D"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "ae_encoder/res1/Mean_2", "op": "Mean", "input": ["ae_encoder/res1/add", "ae_encoder/res1/Mean/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "ae_encoder/res1/sub_2", "op": "Sub", "input": ["ae_encoder/res1/add", "ae_encoder/res1/Mean_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "ae_encoder/res1/reduce_std_2/reduce_variance/Mean", "op": "Mean", "input": ["ae_encoder/res1/sub_2", "ae_encoder/res1/Mean/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "ae_encoder/res1/reduce_std_2/reduce_variance/sub", "op": "SquaredDifference", "input": ["ae_encoder/res1/reduce_std_2/reduce_variance/Mean", "ae_encoder/res1/sub_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "ae_encoder/res1/reduce_std_2/reduce_variance/Mean_1", "op": "Mean", "input": ["ae_encoder/res1/reduce_std_2/reduce_variance/sub", "ae_encoder/res1/Mean/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "ae_encoder/res1/reduce_std_2/Sqrt", "op": "Rsqrt", "input": ["ae_encoder/res1/reduce_std_2/reduce_variance/Mean_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "ae_encoder/res1/truediv_2", "op": "Mul", "input": ["ae_encoder/res1/reduce_std_2/Sqrt", "ae_encoder/res1/sub_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "ae_encoder/res2/conv2d_2/Conv2D", "op": "Conv2D", "input": ["ae_encoder/res1/truediv_2", "ae_encoder/res2/conv2d_2/kernel"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}}}, {"name": "ae_encoder/res2/separable_conv2d_1/separable_conv2d/depthwise", "op": "DepthwiseConv2dNative", "input": ["ae_encoder/res1/truediv_2", "ae_encoder/res2/separable_conv2d_1/depthwise_kernel"], "attr": {"padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}}}, {"name": "ae_encoder/res2/separable_conv2d_1/separable_conv2d", "op": "Conv2D", "input": ["ae_encoder/res2/separable_conv2d_1/separable_conv2d/depthwise", "ae_encoder/res2/separable_conv2d_1/pointwise_kernel"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "padding": {"s": "VkFMSUQ="}}}, {"name": "ae_encoder/res2/Mean", "op": "Mean", "input": ["ae_encoder/res2/separable_conv2d_1/separable_conv2d", "ae_encoder/res1/Mean/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "ae_encoder/res2/sub", "op": "Sub", "input": ["ae_encoder/res2/separable_conv2d_1/separable_conv2d", "ae_encoder/res2/Mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "ae_encoder/res2/reduce_std/reduce_variance/Mean", "op": "Mean", "input": ["ae_encoder/res2/sub", "ae_encoder/res1/Mean/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "ae_encoder/res2/reduce_std/reduce_variance/sub", "op": "SquaredDifference", "input": ["ae_encoder/res2/reduce_std/reduce_variance/Mean", "ae_encoder/res2/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "ae_encoder/res2/reduce_std/reduce_variance/Mean_1", "op": "Mean", "input": ["ae_encoder/res2/reduce_std/reduce_variance/sub", "ae_encoder/res1/Mean/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "ae_encoder/res2/reduce_std/Sqrt", "op": "Rsqrt", "input": ["ae_encoder/res2/reduce_std/reduce_variance/Mean_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "ae_encoder/res2/truediv", "op": "Mul", "input": ["ae_encoder/res2/reduce_std/Sqrt", "ae_encoder/res2/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "ae_encoder/res2/LeakyRelu", "op": "LeakyRelu", "input": ["ae_encoder/res2/truediv"], "attr": {"T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.20000000298023224}}}, {"name": "ae_encoder/res2/conv2d_3/Conv2D", "op": "Conv2D", "input": ["ae_encoder/res2/LeakyRelu", "ae_encoder/res2/conv2d_3/kernel"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}}}, {"name": "ae_encoder/res2/Mean_1", "op": "Mean", "input": ["ae_encoder/res2/conv2d_3/Conv2D", "ae_encoder/res1/Mean/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "ae_encoder/res2/sub_1", "op": "Sub", "input": ["ae_encoder/res2/separable_conv2d_1/separable_conv2d", "ae_encoder/res2/Mean_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "ae_encoder/res2/reduce_std_1/reduce_variance/Mean", "op": "Mean", "input": ["ae_encoder/res2/sub_1", "ae_encoder/res1/Mean/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "ae_encoder/res2/reduce_std_1/reduce_variance/sub", "op": "SquaredDifference", "input": ["ae_encoder/res2/reduce_std_1/reduce_variance/Mean", "ae_encoder/res2/sub_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "ae_encoder/res2/reduce_std_1/reduce_variance/Mean_1", "op": "Mean", "input": ["ae_encoder/res2/reduce_std_1/reduce_variance/sub", "ae_encoder/res1/Mean/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "ae_encoder/res2/reduce_std_1/Sqrt", "op": "Rsqrt", "input": ["ae_encoder/res2/reduce_std_1/reduce_variance/Mean_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "ae_encoder/res2/truediv_1", "op": "Mul", "input": ["ae_encoder/res2/reduce_std_1/Sqrt", "ae_encoder/res2/sub_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "ae_encoder/res2/LeakyRelu_1", "op": "LeakyRelu", "input": ["ae_encoder/res2/truediv_1"], "attr": {"T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.20000000298023224}}}, {"name": "ae_encoder/res2/add", "op": "AddV2", "input": ["ae_encoder/res2/LeakyRelu_1", "ae_encoder/res2/conv2d_2/Conv2D"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "ae_encoder/res2/Mean_2", "op": "Mean", "input": ["ae_encoder/res2/add", "ae_encoder/res1/Mean/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "ae_encoder/res2/sub_2", "op": "Sub", "input": ["ae_encoder/res2/add", "ae_encoder/res2/Mean_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "ae_encoder/res2/reduce_std_2/reduce_variance/Mean", "op": "Mean", "input": ["ae_encoder/res2/sub_2", "ae_encoder/res1/Mean/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "ae_encoder/res2/reduce_std_2/reduce_variance/sub", "op": "SquaredDifference", "input": ["ae_encoder/res2/reduce_std_2/reduce_variance/Mean", "ae_encoder/res2/sub_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "ae_encoder/res2/reduce_std_2/reduce_variance/Mean_1", "op": "Mean", "input": ["ae_encoder/res2/reduce_std_2/reduce_variance/sub", "ae_encoder/res1/Mean/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "ae_encoder/res2/reduce_std_2/Sqrt", "op": "Rsqrt", "input": ["ae_encoder/res2/reduce_std_2/reduce_variance/Mean_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "ae_encoder/res2/truediv_2", "op": "Mul", "input": ["ae_encoder/res2/reduce_std_2/Sqrt", "ae_encoder/res2/sub_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "ae_encoder/res3/conv2d_4/Conv2D", "op": "Conv2D", "input": ["ae_encoder/res2/truediv_2", "ae_encoder/res3/conv2d_4/kernel"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}}}, {"name": "ae_encoder/res3/separable_conv2d_2/separable_conv2d/depthwise", "op": "DepthwiseConv2dNative", "input": ["ae_encoder/res2/truediv_2", "ae_encoder/res3/separable_conv2d_2/depthwise_kernel"], "attr": {"padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}}}, {"name": "ae_encoder/res3/separable_conv2d_2/separable_conv2d", "op": "Conv2D", "input": ["ae_encoder/res3/separable_conv2d_2/separable_conv2d/depthwise", "ae_encoder/res3/separable_conv2d_2/pointwise_kernel"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "padding": {"s": "VkFMSUQ="}}}, {"name": "ae_encoder/res3/Mean", "op": "Mean", "input": ["ae_encoder/res3/separable_conv2d_2/separable_conv2d", "ae_encoder/res1/Mean/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "ae_encoder/res3/sub", "op": "Sub", "input": ["ae_encoder/res3/separable_conv2d_2/separable_conv2d", "ae_encoder/res3/Mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "ae_encoder/res3/reduce_std/reduce_variance/Mean", "op": "Mean", "input": ["ae_encoder/res3/sub", "ae_encoder/res1/Mean/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "ae_encoder/res3/reduce_std/reduce_variance/sub", "op": "SquaredDifference", "input": ["ae_encoder/res3/reduce_std/reduce_variance/Mean", "ae_encoder/res3/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "ae_encoder/res3/reduce_std/reduce_variance/Mean_1", "op": "Mean", "input": ["ae_encoder/res3/reduce_std/reduce_variance/sub", "ae_encoder/res1/Mean/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "ae_encoder/res3/reduce_std/Sqrt", "op": "Rsqrt", "input": ["ae_encoder/res3/reduce_std/reduce_variance/Mean_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "ae_encoder/res3/truediv", "op": "Mul", "input": ["ae_encoder/res3/reduce_std/Sqrt", "ae_encoder/res3/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "ae_encoder/res3/LeakyRelu", "op": "LeakyRelu", "input": ["ae_encoder/res3/truediv"], "attr": {"T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.20000000298023224}}}, {"name": "ae_encoder/res3/conv2d_5/Conv2D", "op": "Conv2D", "input": ["ae_encoder/res3/LeakyRelu", "ae_encoder/res3/conv2d_5/kernel"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}}}, {"name": "ae_encoder/res3/Mean_1", "op": "Mean", "input": ["ae_encoder/res3/conv2d_5/Conv2D", "ae_encoder/res1/Mean/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "ae_encoder/res3/sub_1", "op": "Sub", "input": ["ae_encoder/res3/separable_conv2d_2/separable_conv2d", "ae_encoder/res3/Mean_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "ae_encoder/res3/reduce_std_1/reduce_variance/Mean", "op": "Mean", "input": ["ae_encoder/res3/sub_1", "ae_encoder/res1/Mean/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "ae_encoder/res3/reduce_std_1/reduce_variance/sub", "op": "SquaredDifference", "input": ["ae_encoder/res3/reduce_std_1/reduce_variance/Mean", "ae_encoder/res3/sub_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "ae_encoder/res3/reduce_std_1/reduce_variance/Mean_1", "op": "Mean", "input": ["ae_encoder/res3/reduce_std_1/reduce_variance/sub", "ae_encoder/res1/Mean/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "ae_encoder/res3/reduce_std_1/Sqrt", "op": "Rsqrt", "input": ["ae_encoder/res3/reduce_std_1/reduce_variance/Mean_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "ae_encoder/res3/truediv_1", "op": "Mul", "input": ["ae_encoder/res3/reduce_std_1/Sqrt", "ae_encoder/res3/sub_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "ae_encoder/res3/LeakyRelu_1", "op": "LeakyRelu", "input": ["ae_encoder/res3/truediv_1"], "attr": {"T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.20000000298023224}}}, {"name": "ae_encoder/res3/add", "op": "AddV2", "input": ["ae_encoder/res3/LeakyRelu_1", "ae_encoder/res3/conv2d_4/Conv2D"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "ae_encoder/res3/Mean_2", "op": "Mean", "input": ["ae_encoder/res3/add", "ae_encoder/res1/Mean/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "ae_encoder/res3/sub_2", "op": "Sub", "input": ["ae_encoder/res3/add", "ae_encoder/res3/Mean_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "ae_encoder/res3/reduce_std_2/reduce_variance/Mean", "op": "Mean", "input": ["ae_encoder/res3/sub_2", "ae_encoder/res1/Mean/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "ae_encoder/res3/reduce_std_2/reduce_variance/sub", "op": "SquaredDifference", "input": ["ae_encoder/res3/reduce_std_2/reduce_variance/Mean", "ae_encoder/res3/sub_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "ae_encoder/res3/reduce_std_2/reduce_variance/Mean_1", "op": "Mean", "input": ["ae_encoder/res3/reduce_std_2/reduce_variance/sub", "ae_encoder/res1/Mean/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "ae_encoder/res3/reduce_std_2/Sqrt", "op": "Rsqrt", "input": ["ae_encoder/res3/reduce_std_2/reduce_variance/Mean_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "ae_encoder/res3/truediv_2", "op": "Mul", "input": ["ae_encoder/res3/reduce_std_2/Sqrt", "ae_encoder/res3/sub_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "ae_encoder/res4/conv2d_6/Conv2D", "op": "Conv2D", "input": ["ae_encoder/res3/truediv_2", "ae_encoder/res4/conv2d_6/kernel"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}}}, {"name": "ae_encoder/res4/separable_conv2d_3/separable_conv2d/depthwise", "op": "DepthwiseConv2dNative", "input": ["ae_encoder/res3/truediv_2", "ae_encoder/res4/separable_conv2d_3/depthwise_kernel"], "attr": {"padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}}}, {"name": "ae_encoder/res4/separable_conv2d_3/separable_conv2d", "op": "Conv2D", "input": ["ae_encoder/res4/separable_conv2d_3/separable_conv2d/depthwise", "ae_encoder/res4/separable_conv2d_3/pointwise_kernel"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "VkFMSUQ="}}}, {"name": "ae_encoder/res4/Mean", "op": "Mean", "input": ["ae_encoder/res4/separable_conv2d_3/separable_conv2d", "ae_encoder/res1/Mean/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "ae_encoder/res4/sub", "op": "Sub", "input": ["ae_encoder/res4/separable_conv2d_3/separable_conv2d", "ae_encoder/res4/Mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "ae_encoder/res4/reduce_std/reduce_variance/Mean", "op": "Mean", "input": ["ae_encoder/res4/sub", "ae_encoder/res1/Mean/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "ae_encoder/res4/reduce_std/reduce_variance/sub", "op": "SquaredDifference", "input": ["ae_encoder/res4/reduce_std/reduce_variance/Mean", "ae_encoder/res4/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "ae_encoder/res4/reduce_std/reduce_variance/Mean_1", "op": "Mean", "input": ["ae_encoder/res4/reduce_std/reduce_variance/sub", "ae_encoder/res1/Mean/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "ae_encoder/res4/reduce_std/Sqrt", "op": "Rsqrt", "input": ["ae_encoder/res4/reduce_std/reduce_variance/Mean_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "ae_encoder/res4/truediv", "op": "Mul", "input": ["ae_encoder/res4/reduce_std/Sqrt", "ae_encoder/res4/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "ae_encoder/res4/LeakyRelu", "op": "LeakyRelu", "input": ["ae_encoder/res4/truediv"], "attr": {"T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.20000000298023224}}}, {"name": "ae_encoder/res4/conv2d_7/Conv2D", "op": "Conv2D", "input": ["ae_encoder/res4/LeakyRelu", "ae_encoder/res4/conv2d_7/kernel"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}}}, {"name": "ae_encoder/res4/Mean_1", "op": "Mean", "input": ["ae_encoder/res4/conv2d_7/Conv2D", "ae_encoder/res1/Mean/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "ae_encoder/res4/sub_1", "op": "Sub", "input": ["ae_encoder/res4/separable_conv2d_3/separable_conv2d", "ae_encoder/res4/Mean_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "ae_encoder/res4/reduce_std_1/reduce_variance/Mean", "op": "Mean", "input": ["ae_encoder/res4/sub_1", "ae_encoder/res1/Mean/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "ae_encoder/res4/reduce_std_1/reduce_variance/sub", "op": "SquaredDifference", "input": ["ae_encoder/res4/reduce_std_1/reduce_variance/Mean", "ae_encoder/res4/sub_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "ae_encoder/res4/reduce_std_1/reduce_variance/Mean_1", "op": "Mean", "input": ["ae_encoder/res4/reduce_std_1/reduce_variance/sub", "ae_encoder/res1/Mean/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "ae_encoder/res4/reduce_std_1/Sqrt", "op": "Rsqrt", "input": ["ae_encoder/res4/reduce_std_1/reduce_variance/Mean_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "ae_encoder/res4/truediv_1", "op": "Mul", "input": ["ae_encoder/res4/reduce_std_1/Sqrt", "ae_encoder/res4/sub_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "ae_encoder/res4/LeakyRelu_1", "op": "LeakyRelu", "input": ["ae_encoder/res4/truediv_1"], "attr": {"T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.20000000298023224}}}, {"name": "ae_encoder/res4/add", "op": "AddV2", "input": ["ae_encoder/res4/LeakyRelu_1", "ae_encoder/res4/conv2d_6/Conv2D"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "ae_encoder/res4/Mean_2", "op": "Mean", "input": ["ae_encoder/res4/add", "ae_encoder/res1/Mean/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "ae_encoder/res4/sub_2", "op": "Sub", "input": ["ae_encoder/res4/add", "ae_encoder/res4/Mean_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "ae_encoder/res4/reduce_std_2/reduce_variance/Mean", "op": "Mean", "input": ["ae_encoder/res4/sub_2", "ae_encoder/res1/Mean/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "ae_encoder/res4/reduce_std_2/reduce_variance/sub", "op": "SquaredDifference", "input": ["ae_encoder/res4/reduce_std_2/reduce_variance/Mean", "ae_encoder/res4/sub_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "ae_encoder/res4/reduce_std_2/reduce_variance/Mean_1", "op": "Mean", "input": ["ae_encoder/res4/reduce_std_2/reduce_variance/sub", "ae_encoder/res1/Mean/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "ae_encoder/res4/reduce_std_2/Sqrt", "op": "Rsqrt", "input": ["ae_encoder/res4/reduce_std_2/reduce_variance/Mean_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "ae_encoder/res4/truediv_2", "op": "Mul", "input": ["ae_encoder/res4/reduce_std_2/Sqrt", "ae_encoder/res4/sub_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "ae_encoder/res6/conv2d_8/Conv2D", "op": "Conv2D", "input": ["ae_encoder/res4/truediv_2", "ae_encoder/res6/conv2d_8/kernel"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}}}, {"name": "ae_encoder/res6/separable_conv2d_4/separable_conv2d/depthwise", "op": "DepthwiseConv2dNative", "input": ["ae_encoder/res4/truediv_2", "ae_encoder/res6/separable_conv2d_4/depthwise_kernel"], "attr": {"padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}}}, {"name": "ae_encoder/res6/separable_conv2d_4/separable_conv2d", "op": "Conv2D", "input": ["ae_encoder/res6/separable_conv2d_4/separable_conv2d/depthwise", "ae_encoder/res6/separable_conv2d_4/pointwise_kernel"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "VkFMSUQ="}}}, {"name": "ae_encoder/res6/Mean", "op": "Mean", "input": ["ae_encoder/res6/separable_conv2d_4/separable_conv2d", "ae_encoder/res1/Mean/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "ae_encoder/res6/sub", "op": "Sub", "input": ["ae_encoder/res6/separable_conv2d_4/separable_conv2d", "ae_encoder/res6/Mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "ae_encoder/res6/reduce_std/reduce_variance/Mean", "op": "Mean", "input": ["ae_encoder/res6/sub", "ae_encoder/res1/Mean/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "ae_encoder/res6/reduce_std/reduce_variance/sub", "op": "SquaredDifference", "input": ["ae_encoder/res6/reduce_std/reduce_variance/Mean", "ae_encoder/res6/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "ae_encoder/res6/reduce_std/reduce_variance/Mean_1", "op": "Mean", "input": ["ae_encoder/res6/reduce_std/reduce_variance/sub", "ae_encoder/res1/Mean/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "ae_encoder/res6/reduce_std/Sqrt", "op": "Rsqrt", "input": ["ae_encoder/res6/reduce_std/reduce_variance/Mean_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "ae_encoder/res6/truediv", "op": "Mul", "input": ["ae_encoder/res6/reduce_std/Sqrt", "ae_encoder/res6/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "ae_encoder/res6/LeakyRelu", "op": "LeakyRelu", "input": ["ae_encoder/res6/truediv"], "attr": {"T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.20000000298023224}}}, {"name": "ae_encoder/res6/conv2d_9/Conv2D", "op": "Conv2D", "input": ["ae_encoder/res6/LeakyRelu", "ae_encoder/res6/conv2d_9/kernel"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}}}, {"name": "ae_encoder/res6/Mean_1", "op": "Mean", "input": ["ae_encoder/res6/conv2d_9/Conv2D", "ae_encoder/res1/Mean/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "ae_encoder/res6/sub_1", "op": "Sub", "input": ["ae_encoder/res6/separable_conv2d_4/separable_conv2d", "ae_encoder/res6/Mean_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "ae_encoder/res6/reduce_std_1/reduce_variance/Mean", "op": "Mean", "input": ["ae_encoder/res6/sub_1", "ae_encoder/res1/Mean/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "ae_encoder/res6/reduce_std_1/reduce_variance/sub", "op": "SquaredDifference", "input": ["ae_encoder/res6/reduce_std_1/reduce_variance/Mean", "ae_encoder/res6/sub_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "ae_encoder/res6/reduce_std_1/reduce_variance/Mean_1", "op": "Mean", "input": ["ae_encoder/res6/reduce_std_1/reduce_variance/sub", "ae_encoder/res1/Mean/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "ae_encoder/res6/reduce_std_1/Sqrt", "op": "Rsqrt", "input": ["ae_encoder/res6/reduce_std_1/reduce_variance/Mean_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "ae_encoder/res6/truediv_1", "op": "Mul", "input": ["ae_encoder/res6/reduce_std_1/Sqrt", "ae_encoder/res6/sub_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": 